utils/stress_testing/stress.yaml
config:
  target: 'http://localhost:3333'
  phases:
    - duration: 60
      arrivalRate: 1000
  processor: './simulation-routes.js'
scenarios:
  - flow:
    - function: 'generateRandomData'
    - get:
        url: "/api/reserve/query/{{ restaurantId }}/{{ date }}/{{ time }}"
    # - log: "Sending a request to /api/reserve/query/{{ restaurantId }}/{{ date }}/{{ time }}"